r-oung/stm32f4-firmware/prj/uwb-positioning/src/deca_regs.h
#define CLEAR_ALLRXERROR_EVENTS (SYS_STATUS_RXPHE | SYS_STATUS_RXFCE | SYS_STATUS_RXRFSL | \
			 	 	 	 		SYS_STATUS_RXSFDTO | SYS_STATUS_RXRFTO | SYS_STATUS_RXPTO |\
                                SYS_STATUS_AFFREJ | SYS_STATUS_LDEERR) /* Clear all RX event flags after an rx error */

#define CLEAR_ALLTX_EVENTS	    (SYS_STATUS_AAT | SYS_STATUS_TXFRB | SYS_STATUS_TXPRS | \
								SYS_STATUS_TXPHS | SYS_STATUS_TXFRS	) /* Clear all TX event flags */


/****************************************************************************//**
 * @brief Bit definitions for register RX_FINFO
**/
#define RX_FINFO_ID             0x10            /* RX Frame Information (in double buffer set) */
#define RX_FINFO_LEN            (4)
/*mask and shift */
#define RX_FINFO_MASK_32		0xFFFFFBFFUL	/* System event Status Register access mask (all unused fields should always be writen as zero) */
#define RX_FINFO_RXFLEN_MASK 	0x0000007FUL	/* Receive Frame Length (0 to 127) */
#define RX_FINFO_RXFLE_MASK    	0x00000380UL	/* Receive Frame Length Extension (0 to 7)<<7 */
#define RX_FINFO_RXFL_MASK_1023 0x000003FFUL 	/* Receive Frame Length Extension (0 to 1023) */

#define RX_FINFO_RXNSPL_MASK	0x00001800UL	/* Receive Non-Standard Preamble Length */
#define RX_FINFO_RXPSR_MASK		0x000C0000UL	/* RX Preamble Repetition. 00 = 16 symbols, 01 = 64 symbols, 10 = 1024 symbols, 11 = 4096 symbols */

#define RX_FINFO_RXPEL_MASK		0x000C1800UL	/* Receive Preamble Length = RXPSR+RXNSPL */
#define RX_FINFO_RXPEL_64		0x00040000UL	/* Receive Preamble length = 64 */
#define RX_FINFO_RXPEL_128		0x00040800UL	/* Receive Preamble length = 128 */
#define RX_FINFO_RXPEL_256		0x00041000UL	/* Receive Preamble length = 256 */
#define RX_FINFO_RXPEL_512		0x00041800UL	/* Receive Preamble length = 512 */
#define RX_FINFO_RXPEL_1024		0x00080000UL	/* Receive Preamble length = 1024 */
#define RX_FINFO_RXPEL_1536		0x00080800UL	/* Receive Preamble length = 1536 */
#define RX_FINFO_RXPEL_2048		0x00081000UL	/* Receive Preamble length = 2048 */
#define RX_FINFO_RXPEL_4096		0x000C0000UL	/* Receive Preamble length = 4096 */

#define RX_FINFO_RXBR_MASK		0x00006000UL	/* Receive Bit Rate report. This field reports the received bit rate */
#define RX_FINFO_RXBR_110k		0x00000000UL	/* Received bit rate = 110 kbps */
#define RX_FINFO_RXBR_850k		0x00002000UL	/* Received bit rate = 850 kbps */
#define RX_FINFO_RXBR_6M		0x00004000UL	/* Received bit rate = 6.8 Mbps */
#define RX_FINFO_RXBR_SHIFT     (13)

#define RX_FINFO_RNG			0x00008000UL	/* Receiver Ranging. Ranging bit in the received PHY header identifying the frame as a ranging packet. */
#define RX_FINFO_RNG_SHIFT      (15)

#define RX_FINFO_RXPRF_MASK		0x00030000UL	/* RX Pulse Repetition Rate report */
#define RX_FINFO_RXPRF_16M		0x00010000UL	/* PRF being employed in the receiver = 16M */
#define RX_FINFO_RXPRF_64M		0x00020000UL	/* PRF being employed in the receiver = 64M */
#define RX_FINFO_RXPRF_SHIFT    (16)

#define RX_FINFO_RXPACC_MASK	0xFFF00000UL	/* Preamble Accumulation Count */
#define RX_FINFO_RXPACC_SHIFT   (20)


/****************************************************************************//**
 * @brief Bit definitions for register RX_BUFFER
**/
#define RX_BUFFER_ID            0x11            /* Receive Data Buffer (in double buffer set) */
#define RX_BUFFER_LEN           (1024)


/****************************************************************************//**
 * @brief Bit definitions for register RX_FQUAL
**/
#define RX_FQUAL_ID             0x12            /* Rx Frame Quality information (in double buffer set) */
#define RX_FQUAL_LEN            (8)				/* note 64 bit register*/
/*mask and shift */
/*offset 0 */
#define RX_EQUAL_STD_NOISE_MASK	0x0000FFFFULL	/* Standard Deviation of Noise */
#define RX_EQUAL_STD_NOISE_SHIFT (0)
#define STD_NOISE_MASK			RX_EQUAL_STD_NOISE_MASK
#define STD_NOISE_SHIFT 		RX_EQUAL_STD_NOISE_SHIFT
/*offset 16 */
#define RX_EQUAL_FP_AMPL2_MASK	0xFFFF0000ULL	/* First Path Amplitude point 2 */
#define RX_EQUAL_FP_AMPL2_SHIFT (16)
#define FP_AMPL2_MASK			RX_EQUAL_FP_AMPL2_MASK
#define FP_AMPL2_SHIFT			RX_EQUAL_FP_AMPL2_SHIFT
/*offset 32*/
#define RX_EQUAL_PP_AMPL3_MASK	0x0000FFFF00000000ULL	/* First Path Amplitude point 3 */
#define RX_EQUAL_PP_AMPL3_SHIFT	(32)
#define PP_AMPL3_MASK			RX_EQUAL_PP_AMPL3_MASK
#define PP_AMPL3_SHIFT			RX_EQUAL_PP_AMPL3_SHIFT
/*offset 48*/
#define RX_EQUAL_CIR_MXG_MASK	0xFFFF000000000000ULL	/* Channel Impulse Response Max Growth */
#define RX_EQUAL_CIR_MXG_SHIFT	(48)
#define CIR_MXG_MASK			RX_EQUAL_CIR_MXG_MASK
#define CIR_MXG_SHIFT			RX_EQUAL_CIR_MXG_SHIFT



/****************************************************************************//**
 * @brief Bit definitions for register RX_TTCKI
 * 		The value here is the interval over which the timing offset reported
 * 		in the RXTOFS field of Register file: 0x14 – RX_TTCKO is measured.
 * 		The clock offset is calculated by dividing RXTTCKI by RXTOFS.
 * 		The value in RXTTCKI will take just one of two values depending on the PRF: 0x01F00000 @ 16 MHz PRF,
 * 		and 0x01FC0000 @ 64 MHz PRF.
**/
#define RX_TTCKI_ID             0x13            /* Receiver Time Tracking Interval (in double buffer set) */
#define RX_TTCKI_LEN            (4)

/****************************************************************************//**
 * @brief Bit definitions for register RX_TTCKO
**/
#define RX_TTCKO_ID	            0x14            /* Receiver Time Tracking Offset (in double buffer set) */
#define RX_TTCKO_LEN            (5)				/* Note 40 bit register */
/*mask and shift */
#define RX_TTCKO_MASK_32		0xFF07FFFFUL	/* Receiver Time Tracking Offset access mask (all unused fields should always be writen as zero) */
/*offset 0 */
#define RX_TTCKO_RXTOFS_MASK	0x0007FFFFUL	/* RX time tracking offset. This RXTOFS value is a 19-bit signed quantity*/
/*offset 24 */
#define RX_TTCKO_RSMPDEL_MASK	0xFF000000UL	/* This 8-bit field reports an internal re-sampler delay value */
/*offset 32 */
#define RX_TTCKO_RCPHASE_MASK	0x7F0000000000ULL	/* This 7-bit field reports the receive carrier phase adjustment at time the ranging timestamp is made. */


/****************************************************************************//**
 * @brief Bit definitions for register RX_TIME
**/
#define RX_TIME_ID              0x15            /* Receive Message Time of Arrival (in double buffer set) */
#define RX_TIME_LLEN            (14)
#define RX_TIME_RX_STAMP_LEN    (5)             /* read only 5 bytes (the adjusted timestamp (40:0)) */
#define RX_STAMP_LEN			RX_TIME_RX_STAMP_LEN
/*mask and shift */
#define RX_TIME_RX_STAMP_OFFSET  (0) /* byte 0..4 40 bit Reports the fully adjusted time of reception. */
#define RX_TIME_FP_INDEX_OFFSET  (5)	/* byte 5..6 16 bit First path index. */
#define RX_TIME_FP_AMPL1_OFFSET  (7)	/* byte 7..8 16 bit First Path Amplitude point 1 */   /* doc bug */
#define RX_TIME_FP_RAWST_OFFSET  (9)	/* byte 9..13 40 bit Raw Timestamp for the frame */


/****************************************************************************//**
 * @brief Bit definitions for register
**/
#define REG_16_ID_RESERVED		0x16


/****************************************************************************//**
 * @brief Bit definitions for register
**/
#define TX_TIME_ID              0x17            /* Transmit Message Time of Sending */
#define TX_TIME_LLEN            (10)
#define TX_TIME_TX_STAMP_LEN    (5)             /* 40-bits = 5 bytes */
#define TX_STAMP_LEN   			TX_TIME_TX_STAMP_LEN
/*mask and shift */
#define TX_TIME_TX_STAMP_OFFSET  (0) /* byte 0..4 40 bit Reports the fully adjusted time of transmission */
#define TX_TIME_TX_RAWST_OFFSET  (5) /* byte 5..9 40 bit Raw Timestamp for the frame */




/****************************************************************************//**
 * @brief Bit definitions for register TX_ANTD
**/
#define TX_ANTD_ID              0x18            /* 16-bit Delay from Transmit to Antenna */
#define TX_ANTD_LEN	            (2)				/* doc bug */




/****************************************************************************//**
 * @brief Bit definitions for register SYS_STATES
 * 		  Register map register file 0x19 is reserved
 *
**/
#define SYS_STATE_ID           	0x19            /* System State information READ ONLY */
#define SYS_STATE_LEN          	(5)

/****************************************************************************//**
 * @brief Bit definitions for register ACK_RESP_T
**/
/* Acknowledge (31:24 preamble symbol delay before auto ACK is sent) and respose (19:0 - unit 1us) timer */
#define ACK_RESP_T_ID           0x1A            /* Acknowledgement Time and Response Time */
#define ACK_RESP_T_LEN          (4)
/*mask and shift */
#define ACK_RESP_T_MASK			0xFF0FFFFFUL	/* Acknowledgement Time and Response access mask */
#define ACK_RESP_T_W4R_TIM_MASK	0x000FFFFFUL	/* Wait-for-Response turn-around Time 20 bit field */
#define W4R_TIM_MASK			ACK_RESP_T_W4R_TIM_MASK
#define ACK_RESP_T_ACK_TIM_MASK	0xFF000000UL	/* Auto-Acknowledgement turn-around Time */
#define ACK_TIM_MASK			ACK_RESP_T_ACK_TIM_MASK



/****************************************************************************//**
 * @brief Bit definitions for register 0x1B 0x1C
**/
#define REG_1B_ID_RESERVED		0x1B
#define REG_1C_ID_RESERVED		0x1C

/****************************************************************************//**
 * @brief Bit definitions for register RX_SNIFF
 * 		  Sniff Mode Configuration or Pulsed Preamble Reception Configuration
**/
#define RX_SNIFF_ID             0x1D            /* Sniff Mode Configuration */
#define RX_SNIFF_LEN			(2)
/*mask and shift */
#define RX_SNIFF_MASK			0x0000FF0FUL	/*  */
#define RX_SNIFF_SNIFF_ONT_MASK	0x0000000FUL	/* SNIFF Mode ON time. Specified in units of PAC */
#define SNIFF_ONT_MASK			RX_SNIFF_SNIFF_ONT_MASK
#define RX_SNIFF_SNIFF_OFFT_MASK 0x0000FF00UL	/* SNIFF Mode OFF time specified in units of approximately 1mkS, or 128 system clock cycles.*/
#define SNIFF_OFFT_MASK			RX_SNIFF_SNIFF_OFFT_MASK



/****************************************************************************//**
 * @brief Bit definitions for register TX_POWER
**/
#define TX_POWER_ID             0x1E            /* TX Power Control */
#define TX_POWER_LEN            (4)
/*mask and shift definition for Smart Transmit Power Control*/
#define TX_POWER_BOOSTNORM_MASK	0x00000000UL	/* This is the normal power setting used for frames that do not fall */
#define BOOSTNORM_MASK			TX_POWER_BOOSTNORM_MASK
#define TX_POWER_BOOSTNORM_SHIFT (0)
#define TX_POWER_BOOSTP500_MASK	0x00000000UL	/* This value sets the power applied during transmission at the 6.8 Mbps data rate frames that are less than 0.5 ms duration */
#define BOOSTP500_MASK			TX_POWER_BOOSTP500_MASK
#define TX_POWER_BOOSTP500_SHIFT (8)
#define TX_POWER_BOOSTP250_MASK	0x00000000UL	/* This value sets the power applied during transmission at the 6.8 Mbps data rate frames that are less than 0.25 ms duration */
#define BOOSTP250_MASK			TX_POWER_BOOSTP250_MASK
#define TX_POWER_BOOSTP250_SHIFT (16)
#define TX_POWER_BOOSTP125_MASK	0x00000000UL	/* This value sets the power applied during transmission at the 6.8 Mbps data rate frames that are less than 0.125 ms */
#define BOOSTP125_MASK			TX_POWER_BOOSTP125_MASK
#define TX_POWER_BOOSTP125_SHIFT (24)
/*mask and shift definition for Manual Transmit Power Control (DIS_STXP=1 in SYS_CFG)*/
#define TX_POWER_MAN_DEFAULT	0x0E080222UL
#define TX_POWER_TXPOWPHR_MASK	0x0000FF00UL	/* This power setting is applied during the transmission of the PHY header (PHR) portion of the frame. */
#define TX_POWER_TXPOWSD_MASK	0x00FF0000UL	/* This power setting is applied during the transmission of the synchronisation header (SHR) and data portions of the frame. */


/****************************************************************************//**
 * @brief Bit definitions for register CHAN_CTRL
**/
#define CHAN_CTRL_ID            0x1F            /* Channel Control */
#define CHAN_CTRL_LEN			(4)
/*mask and shift */
#define CHAN_CTRL_MASK			0xFFFF00FFUL	/* Channel Control Register access mask */
#define CHAN_CTRL_TX_CHAN_MASK	0x0000000FUL	/* Supported channels are 1, 2, 3, 4, 5, and 7.*/
#define CHAN_CTRL_TX_CHAN_SHIFT (0)            	/* Bits 0..3        TX channel number 0-15 selection */

#define CHAN_CTRL_RX_CHAN_MASK	0x000000F0UL
#define CHAN_CTRL_RX_CHAN_SHIFT (4)             /* Bits 4..7        RX channel number 0-15 selection */

#define CHAN_CTRL_RXFPRF_MASK   0x000C0000UL	/* Bits 18..19      Specify (Force) RX Pulse Repetition Rate: 00 = 4 MHz, 01 = 16 MHz, 10 = 64MHz. */
#define CHAN_CTRL_RXFPRF_SHIFT  (18)
/* Specific RXFPRF configuration */
#define CHAN_CTRL_RXFPRF_4   	0x00000000UL	/* Specify (Force) RX Pulse Repetition Rate: 00 = 4 MHz, 01 = 16 MHz, 10 = 64MHz. */
#define CHAN_CTRL_RXFPRF_16   	0x00040000UL	/* Specify (Force) RX Pulse Repetition Rate: 00 = 4 MHz, 01 = 16 MHz, 10 = 64MHz. */
#define CHAN_CTRL_RXFPRF_64   	0x00080000UL	/* Specify (Force) RX Pulse Repetition Rate: 00 = 4 MHz, 01 = 16 MHz, 10 = 64MHz. */
#define CHAN_CTRL_TX_PCOD_MASK  0x07C00000UL    /* Bits 22..26      TX Preamble Code selection, 1 to 24. */
#define CHAN_CTRL_TX_PCOD_SHIFT (22)
#define CHAN_CTRL_RX_PCOD_MASK  0xF8000000UL    /* Bits 27..31      RX Preamble Code selection, 1 to 24. */
#define CHAN_CTRL_RX_PCOD_SHIFT (27)
/*offset 16 */
#define CHAN_CTRL_DWSFD			0x00020000UL	/* Bit 17 This bit enables a non-standard DecaWave proprietary SFD sequence. */
#define CHAN_CTRL_DWSFD_SHIFT   (17)
#define CHAN_CTRL_TNSSFD		0x00100000UL	/* Bit 20 Non-standard SFD in the transmitter */
#define CHAN_CTRL_TNSSFD_SHIFT  (20)
#define CHAN_CTRL_RNSSFD		0x00200000UL	/* Bit 21 Non-standard SFD in the receiver */
#define CHAN_CTRL_RNSSFD_SHIFT  (21)




/****************************************************************************//**
 * @brief Bit definitions for register 0x20
**/
#define REG_20_ID_RESERVED		0x20

/****************************************************************************//**
 * @brief Bit definitions for register USR_SFD
 * 		  Please read User Manual : User defined SFD sequence
**/
#define USR_SFD_ID              0x21            /* User-specified short/long TX/RX SFD sequences */
#define USR_SFD_LEN             (41)


/****************************************************************************//**
 * @brief Bit definitions for register
**/
#define REG_22_ID_RESERVED		0x22

/****************************************************************************//**
 * @brief Bit definitions for register AGC_CTRL
 * Please take care to write to this register as doing so may cause the DW1000 to malfunction
**/
#define AGC_CTRL_ID             0x23            /* Automatic Gain Control configuration */
#define AGC_CTRL_LEN			(32)
#define AGC_CFG_STS_ID			AGC_CTRL_ID
/* offset from AGC_CTRL_ID in bytes */
#define AGC_CTRL1_OFFSET		(0x02)
#define AGC_CTRL1_LEN			(2)
#define AGC_CTRL1_MASK			0x0001			/* access mask to AGC configuration and control register */
#define AGC_CTRL1_DIS_AM		0x0001			/* Disable AGC Measurement. The DIS_AM bit is set by default. */
/* offset from AGC_CTRL_ID in bytes */
/* Please take care not to write other values to this register as doing so may cause the DW1000 to malfunction */
#define AGC_TUNE1_OFFSET		(0x04)
#define AGC_TUNE1_LEN			(2)
#define AGC_TUNE1_MASK			0xFFFF			/* It is a 16-bit tuning register for the AGC. */
#define AGC_TUNE1_16M			0x8870
#define AGC_TUNE1_64M			0x889B
/* offset from AGC_CTRL_ID in bytes */
/* Please take care not to write other values to this register as doing so may cause the DW1000 to malfunction */
#define AGC_TUNE2_OFFSET		(0x0C)
#define AGC_TUNE2_LEN			(4)
#define AGC_TUNE2_MASK			0xFFFFFFFFUL
#define AGC_TUNE2_VAL			0X2502A907UL
/* offset from AGC_CTRL_ID in bytes */
/* Please take care not to write other values to this register as doing so may cause the DW1000 to malfunction */
#define AGC_TUNE3_OFFSET		(0x12)
#define AGC_TUNE3_LEN			(2)
#define AGC_TUNE3_MASK			0xFFFF
#define AGC_TUNE3_VAL			0X0055
/* offset from AGC_CTRL_ID in bytes */
#define AGC_STAT1_OFFSET		(0x1E)
#define AGC_STAT1_LEN			(3)
#define AGC_STAT1_MASK			0x0FFFFF
#define AGC_STAT1_EDG1_MASK		0x0007C0		/* This 5-bit gain value relates to input noise power measurement. */
#define AGC_STAT1_EDV2_MASK		0x0FF800		/* This 9-bit value relates to the input noise power measurement. */

/****************************************************************************//**
 * @brief Bit definitions for register EXT_SYNC
**/
#define EXT_SYNC_ID             0x24            /* External synchronisation control */
#define EXT_SYNC_LEN			(12)
/* offset from EXT_SYNC_ID in bytes */
#define EC_CTRL_OFFSET			(0x00)
#define EC_CTRL_LEN				(4)
#define EC_CTRL_MASK			0x00000FFBUL	/* sub-register 0x00 is the External clock synchronisation counter configuration register */
#define EC_CTRL_OSTSM			0x00000001UL	/* External transmit synchronisation mode enable */
#define EC_CTRL_OSRSM			0x00000002UL	/* External receive synchronisation mode enable */
#define EC_CTRL_OSTRM			0x00000800UL	/* External timebase reset mode enable */
#define EC_CTRL_WAIT_MASK		0x000007F8UL	/* Wait counter used for external transmit synchronisation and external timebase reset */
/* offset from EXT_SYNC_ID in bytes */
#define EC_RXTC_OFFSET			(0x04)
#define EC_RXTC_LEN				(4)
#define EC_RXTC_MASK			0xFFFFFFFFUL	/* External clock synchronisation counter captured on RMARKER */
/* offset from EXT_SYNC_ID in bytes */
#define EC_GOLP					(0x08)
#define EC_GOLP_LEN				(4)
#define EC_GOLP_MASK			0x0000003FUL	/* sub-register 0x08 is the External clock offset to first path 1 GHz counter, EC_GOLP */
#define EC_GOLP_OFFSET_EXT_MASK	0x0000003FUL	/* This register contains the 1 GHz count from the arrival of the RMARKER and the next edge of the external clock. */


/****************************************************************************//**
 * @brief Bit definitions for register ACC_MEM
**/
#define ACC_MEM_ID              0x25            /* Read access to accumulator data */
#define ACC_MEM_LEN             (4064)


/****************************************************************************//**
 * @brief Bit definitions for register GPIO_CTRL
**/
#define GPIO_CTRL_ID            0x26            /* Peripheral register bus 1 access - GPIO control */
#define GPIO_CTRL_LEN           (44)

/* offset from EXT_SYNC_ID in bytes */
#define GPIO_MODE_OFFSET		0x00			/* sub-register 0x00 is the GPIO Mode Control Register */
#define GPIO_MODE_LEN			(4)
#define GPIO_MODE_MASK			0x00FFFFC0UL

