r-oung/stm32f4-firmware/prj/uwb-positioning/src/deca_regs.h
#define GPIO_MSGP0_MASK			0x000000C0UL	/* Mode Selection for GPIO0/RXOKLED */
#define GPIO_MSGP1_MASK			0x00000300UL	/* Mode Selection for GPIO1/SFDLED */
#define GPIO_MSGP2_MASK			0x00000C00UL	/* Mode Selection for GPIO2/RXLED */
#define GPIO_MSGP3_MASK			0x00003000UL	/* Mode Selection for GPIO3/TXLED */
#define GPIO_MSGP4_MASK			0x0000C000UL	/* Mode Selection for GPIO4/EXTPA */
#define GPIO_MSGP5_MASK			0x00030000UL	/* Mode Selection for GPIO5/EXTTXE */
#define GPIO_MSGP6_MASK			0x000C0000UL	/* Mode Selection for GPIO6/EXTRXE */
#define GPIO_MSGP7_MASK			0x00300000UL	/* Mode Selection for SYNC/GPIO7 */
#define GPIO_MSGP8_MASK			0x00C00000UL	/* Mode Selection for IRQ/GPIO8 */

#define GPIO_RXOKLED_EN			0x00000040UL 	/* Bit for selecting RXOKLED */
#define GPIO_SFDLED_EN			0x00000100UL    /* Bit for selecting SFDLED */
#define GPIO_RXLED_EN			0x00000400UL    /* Bit for selecting RXLED */
#define GPIO_TXLED_EN			0x00001000UL    /* Bit for selecting TXLED */
#define GPIO_EXTPA_EN			0x00004000UL    /* Bit for selecting EXTPA */
#define GPIO_EXTTXE_EN			0x00010000UL    /* Bit for selecting EXTTXE */
#define GPIO_EXTRXE_EN			0x00040000UL    /* Bit for selecting EXTRXE */

/* offset from EXT_SYNC_ID in bytes */
#define GPIO_DIR_OFFSET			0x08			/* sub-register 0x08 is the GPIO Direction Control Register */
#define GPIO_DIR_LEN			(4)
#define GPIO_DIR_MASK			0x0011FFFFUL

#define GxP0					0x00000001UL	/* GPIO0 Only changed if the GxM0 mask bit has a value of 1 for the write operation*/
#define GxP1					0x00000002UL	/* GPIO1. (See GDP0). */
#define GxP2					0x00000004UL	/* GPIO2. (See GDP0). */
#define GxP3					0x00000008UL	/* GPIO3. (See GDP0). */
#define GxP4					0x00000100UL	/* GPIO4. (See GDP0). */
#define GxP5					0x00000200UL	/* GPIO5. (See GDP0). */
#define GxP6					0x00000400UL	/* GPIO6. (See GDP0). */
#define GxP7					0x00000800UL	/* GPIO7. (See GDP0). */
#define GxP8					0x00010000UL	/* GPIO8 */

#define GxM0					0x00000010UL	/* Mask for GPIO0 */
#define GxM1					0x00000020UL	/* Mask for GPIO1. (See GDM0). */
#define GxM2					0x00000040UL	/* Mask for GPIO2. (See GDM0). */
#define GxM3					0x00000080UL	/* Mask for GPIO3. (See GDM0). */
#define GxM4					0x00001000UL	/* Mask for GPIO4. (See GDM0). */
#define GxM5					0x00002000UL	/* Mask for GPIO5. (See GDM0). */
#define GxM6					0x00004000UL	/* Mask for GPIO6. (See GDM0). */
#define GxM7					0x00008000UL	/* Mask for GPIO7. (See GDM0). */
#define GxM8					0x00100000UL	/* Mask for GPIO8. (See GDM0). */

#define GDP0	GxP0	/* Direction Selection for GPIO0. 1 = input, 0 = output. Only changed if the GDM0 mask bit has a value of 1 for the write operation*/
#define GDP1	GxP1	/* Direction Selection for GPIO1. (See GDP0). */
#define GDP2	GxP2	/* Direction Selection for GPIO2. (See GDP0). */
#define GDP3	GxP3	/* Direction Selection for GPIO3. (See GDP0). */
#define GDP4	GxP4	/* Direction Selection for GPIO4. (See GDP0). */
#define GDP5	GxP5	/* Direction Selection for GPIO5. (See GDP0). */
#define GDP6	GxP6	/* Direction Selection for GPIO6. (See GDP0). */
#define GDP7	GxP7	/* Direction Selection for GPIO7. (See GDP0). */
#define GDP8	GxP8	/* Direction Selection for GPIO8 */

#define GDM0	GxM0	/* Mask for setting the direction of GPIO0 */
#define GDM1	GxM1	/* Mask for setting the direction of GPIO1. (See GDM0). */
#define GDM2	GxM2	/* Mask for setting the direction of GPIO2. (See GDM0). */
#define GDM3	GxM3	/* Mask for setting the direction of GPIO3. (See GDM0). */
#define GDM4	GxM4	/* Mask for setting the direction of GPIO4. (See GDM0). */
#define GDM5	GxM5	/* Mask for setting the direction of GPIO5. (See GDM0). */
#define GDM6	GxM6	/* Mask for setting the direction of GPIO6. (See GDM0). */
#define GDM7	GxM7	/* Mask for setting the direction of GPIO7. (See GDM0). */
#define GDM8	GxM8	/* Mask for setting the direction of GPIO8. (See GDM0). */

/* offset from EXT_SYNC_ID in bytes */
#define GPIO_DOUT_OFFSET		0x0C			/* sub-register 0x0C is the GPIO data output register. */
#define GPIO_DOUT_LEN			(4)
#define GPIO_DOUT_MASK			GPIO_DIR_MASK

/* offset from EXT_SYNC_ID in bytes */
#define GPIO_IRQE_OFFSET		0x10			/* sub-register 0x10 is the GPIO interrupt enable register */
#define GPIO_IRQE_LEN			(4)
#define GPIO_IRQE_MASK			0x000001FFUL
#define GIRQx0					0x00000001UL	/* IRQ bit0 */
#define GIRQx1					0x00000002UL	/* IRQ bit1 */
#define GIRQx2					0x00000004UL	/* IRQ bit2 */
#define GIRQx3					0x00000008UL	/* IRQ bit3 */
#define GIRQx4					0x00000010UL	/* IRQ bit4 */
#define GIRQx5					0x00000020UL	/* IRQ bit5 */
#define GIRQx6					0x00000040UL	/* IRQ bit6 */
#define GIRQx7					0x00000080UL	/* IRQ bit7 */
#define GIRQx8					0x00000100UL	/* IRQ bit8 */
#define GIRQE0	GIRQx0	/* GPIO IRQ Enable for GPIO0 input. Value 1 = enable, 0 = disable*/
#define GIRQE1	GIRQx1	/*  */
#define GIRQE2	GIRQx2	/*  */
#define GIRQE3	GIRQx3	/*  */
#define GIRQE4	GIRQx4	/*  */
#define GIRQE5	GIRQx5	/*  */
#define GIRQE6	GIRQx6	/*  */
#define GIRQE7	GIRQx7	/*  */
#define GIRQE8	GIRQx8	/* Value 1 = enable, 0 = disable */

/* offset from EXT_SYNC_ID in bytes */
#define GPIO_ISEN_OFFSET		0x14 	/* sub-register 0x14 is the GPIO interrupt sense selection register */
#define GPIO_ISEN_LEN			(4)
#define GPIO_ISEN_MASK			GPIO_IRQE_MASK
#define GISEN0	GIRQx0	/* GPIO IRQ Sense selection GPIO0 input. Value 0 = High or Rising-Edge, 1 = Low or falling-edge.*/
#define GISEN1	GIRQx1	/*  */
#define GISEN2	GIRQx2	/*  */
#define GISEN3	GIRQx3	/*  */
#define GISEN4	GIRQx4	/*  */
#define GISEN5	GIRQx5	/*  */
#define GISEN6	GIRQx6	/*  */
#define GISEN7	GIRQx7	/*  */
#define GISEN8	GIRQx8	/* Value 0 = High or Rising-Edge, 1 = Low or falling-edge */

/* offset from EXT_SYNC_ID in bytes */
#define GPIO_IMODE_OFFSET		0x18 	/* sub-register 0x18 is the GPIO interrupt mode selection register */
#define GPIO_IMODE_LEN			(4)
#define GPIO_IMODE_MASK			GPIO_IRQE_MASK
#define GIMOD0	GIRQx0	/* GPIO IRQ Mode selection for GPIO0 input. Value 0 = Level sensitive interrupt. Value 1 = Edge triggered interrupt */
#define GIMOD1	GIRQx1	/*  */
#define GIMOD2	GIRQx2	/*  */
#define GIMOD3	GIRQx3	/*  */
#define GIMOD4	GIRQx4	/*  */
#define GIMOD5	GIRQx5	/*  */
#define GIMOD6	GIRQx6	/*  */
#define GIMOD7	GIRQx7	/*  */
#define GIMOD8	GIRQx8	/* Value 0 = Level, 1 = Edge. */

/* offset from EXT_SYNC_ID in bytes */
#define GPIO_IBES_OFFSET		0x1C	/* sub-register 0x1C is the GPIO interrupt “Both Edge” selection register */
#define GPIO_IBES_LEN			(4)
#define GPIO_IBES_MASK			GPIO_IRQE_MASK	/*  */
#define GIBES0	GIRQx0	/* GPIO IRQ “Both Edge” selection for GPIO0 input. Value 0 = GPIO_IMODE register selects the edge. Value 1 = Both edges trigger the interrupt. */
#define GIBES1	GIRQx1	/*  */
#define GIBES2	GIRQx2	/*  */
#define GIBES3	GIRQx3	/*  */
#define GIBES4	GIRQx4	/*  */
#define GIBES5	GIRQx5	/*  */
#define GIBES6	GIRQx6	/*  */
#define GIBES7	GIRQx7	/*  */
#define GIBES8	GIRQx8	/* Value 0 = use GPIO_IMODE, 1 = Both Edges */

/* offset from EXT_SYNC_ID in bytes */
#define GPIO_ICLR_OFFSET		0x20	/* sub-register 0x20 is the GPIO interrupt clear register */
#define GPIO_ICLR_LEN			(4)
#define GPIO_ICLR_MASK			GPIO_IRQE_MASK	/*  */
#define GICLR0	GIRQx0	/* GPIO IRQ latch clear for GPIO0 input. Write 1 to clear the GPIO0 interrupt latch. Writing 0 has no effect. Reading returns zero */
#define GICLR1	GIRQx1	/*  */
#define GICLR2	GIRQx2	/*  */
#define GICLR3	GIRQx3	/*  */
#define GICLR4	GIRQx4	/*  */
#define GICLR5	GIRQx5	/*  */
#define GICLR6	GIRQx6	/*  */
#define GICLR7	GIRQx7	/*  */
#define GICLR8	GIRQx8	/* Write 1 to clear the interrupt latch */

/* offset from EXT_SYNC_ID in bytes */
#define GPIO_IDBE_OFFSET		0x24	/* sub-register 0x24 is the GPIO interrupt de-bounce enable register */
#define GPIO_IDBE_LEN			(4)
#define GPIO_IDBE_MASK			GPIO_IRQE_MASK
#define GIDBE0	GIRQx0	/* GPIO IRQ de-bounce enable for GPIO0. Value 1 = de-bounce enabled. Value 0 = de-bounce disabled */
#define GIDBE1	GIRQx1	/*  */
#define GIDBE2	GIRQx2	/*  */
#define GIDBE3	GIRQx3	/*  */
#define GIDBE4	GIRQx4	/*  */
#define GIDBE5	GIRQx5	/*  */
#define GIDBE6	GIRQx6	/*  */
#define GIDBE7	GIRQx7	/*  */
#define GIDBE8	GIRQx8	/* Value 1 = de-bounce enabled, 0 = de-bounce disabled */

/* offset from EXT_SYNC_ID in bytes */
#define GPIO_RAW_OFFSET			0x28	/* sub-register 0x28 allows the raw state of the GPIO pin to be read. */
#define GPIO_RAW_LEN			(4)
#define GPIO_RAW_MASK			GPIO_IRQE_MASK
#define GRAWP0	GIRQx0	/* This bit reflects the raw state of GPIO0 */
#define GRAWP1	GIRQx1	/*  */
#define GRAWP2	GIRQx2	/*  */
#define GRAWP3	GIRQx3	/*  */
#define GRAWP4	GIRQx4	/*  */
#define GRAWP5	GIRQx5	/*  */
#define GRAWP6	GIRQx6	/*  */
#define GRAWP7	GIRQx7	/*  */
#define GRAWP8	GIRQx8	/* This bit reflects the raw state of GPIO8 */

/****************************************************************************//**
 * @brief Bit definitions for register	DRX_CONF
 * Digital Receiver configuration block
**/
#define DRX_CONF_ID          	0x27            /* Digital Receiver configuration */
#define DRX_CONF_LEN          	(44)
/* offset from DRX_CONF_ID in bytes */
#define DRX_TUNE0b_OFFSET		(0x02)	/* sub-register 0x02 is a 16-bit tuning register. */
#define DRX_TUNE0b_LEN			(2)
#define DRX_TUNE0b_MASK			0xFFFF	/* 7.2.40.2 Sub-Register 0x27:02 – DRX_TUNE0b */

/* offset from DRX_CONF_ID in bytes */
#define DRX_TUNE1a_OFFSET		0x04	/* 7.2.40.3 Sub-Register 0x27:04 – DRX_TUNE1a */
#define DRX_TUNE1a_LEN			(2)
#define DRX_TUNE1a_MASK			0xFFFF

/* offset from DRX_CONF_ID in bytes */
#define DRX_TUNE1b_OFFSET		0x06	/* 7.2.40.4 Sub-Register 0x27:06 – DRX_TUNE1b */
#define DRX_TUNE1b_LEN			(2)
#define DRX_TUNE1b_MASK			0xFFFF

/* offset from DRX_CONF_ID in bytes */
#define DRX_TUNE2_OFFSET		0x08	/* 7.2.40.5 Sub-Register 0x27:08 – DRX_TUNE2 */
#define DRX_TUNE2_LEN			(4)
#define DRX_TUNE2_MASK			0xFFFFFFFFUL

#define DRX_TUNE2_PAC08_PRF16 	0x311A002DUL
#define DRX_TUNE2_PAC08_PRF64 	0x313B006BUL
#define DRX_TUNE2_PAC16_PRF16 	0x331A0052UL
#define DRX_TUNE2_PAC16_PRF64 	0x333B00BEUL
#define DRX_TUNE2_PAC32_PRF16 	0x351A009AUL
#define DRX_TUNE2_PAC32_PRF64 	0x353B015EUL
#define DRX_TUNE2_PAC64_PRF16 	0x371A011DUL
#define DRX_TUNE2_PAC64_PRF64 	0x373B0296UL


/* offset from DRX_CONF_ID in bytes */
/* WARNING: Please do NOT set DRX_SFDTOC to zero (disabling SFD detection timeout)
 * since this risks IC malfunction due to prolonged receiver activity in the event of false preamble detection.
 */
#define DRX_SFDTOC_OFFSET		0x20	/* 7.2.40.7 Sub-Register 0x27:20 – DRX_SFDTOC */
#define DRX_SFDTOC_LEN			(2)
#define DRX_SFDTOC_MASK			0xFFFF

/* offset from DRX_CONF_ID in bytes */
#define DRX_PRETOC_OFFSET		0x24	/* 7.2.40.9 Sub-Register 0x27:24 – DRX_PRETOC */
#define DRX_PRETOC_LEN			(2)
#define DRX_PRETOC_MASK			0xFFFF

/* offset from DRX_CONF_ID in bytes */
#define DRX_DRX_TUNE4H_OFFSET	0x26	/* 7.2.40.10 Sub-Register 0x27:26 – DRX_TUNE4H */
#define DRX_DRX_TUNE4H_LEN		(2)
#define DRX_DRX_TUNE4H_MASK		0xFFFF



/****************************************************************************//**
 * @brief Bit definitions for register	RF_CONF
 * Analog RF Configuration block
 * Refer to section 7.2.41 Register file: 0x28 – Analog RF configuration block
**/
#define RF_CONF_ID         	    0x28            /* Analog RF Configuration */
#define RF_CONF_LEN           	(58)
#define RF_CONF_TXEN_MASK		0x00400000UL   /* TX enable */
#define RF_CONF_RXEN_MASK		0x00200000UL   /* RX enable */
#define RF_CONF_TXPOW_MASK		0x001F0000UL   /* turn on power all LDOs */
#define RF_CONF_PLLEN_MASK		0x0000E000UL   /* enable PLLs */
#define RF_CONF_TXBLOCKSEN_MASK	0x00001F00UL   /* enable TX blocks */
#define RF_CONF_TXPLLPOWEN_MASK (RF_CONF_PLLEN_MASK | RF_CONF_TXPOW_MASK)
#define RF_CONF_TXALLEN_MASK	(RF_CONF_TXEN_MASK | RF_CONF_TXPOW_MASK | RF_CONF_PLLEN_MASK | RF_CONF_TXBLOCKSEN_MASK)
/* offset from TX_CAL_ID in bytes */
#define RF_RXCTRLH_OFFSET		0x0B	/*  */
/* offset from TX_CAL_ID in bytes */
#define RF_TXCTRL_OFFSET		0x0C	/* Analog TX Control Register */
#define RF_TXCTRL_LEN			(4)
#define	RF_TXCTRL_TXMTUNE_MASK	0x000001E0UL	/* Transmit mixer tuning register */
#define	RF_TXCTRL_TXTXMQ_MASK	0x00000E00UL	/* Transmit mixer Q-factor tuning register */
#define RF_TXCTRL_CH1			0x00005C40UL	/* 32-bit value to program to Sub-Register 0x28:0C – RF_TXCTRL */
#define RF_TXCTRL_CH2			0x00045CA0UL	/* 32-bit value to program to Sub-Register 0x28:0C – RF_TXCTRL */
#define RF_TXCTRL_CH3			0x00086CC0UL	/* 32-bit value to program to Sub-Register 0x28:0C – RF_TXCTRL */
#define RF_TXCTRL_CH4			0x00045C80UL	/* 32-bit value to program to Sub-Register 0x28:0C – RF_TXCTRL */
#define RF_TXCTRL_CH5			0x001E3FE0UL	/* 32-bit value to program to Sub-Register 0x28:0C – RF_TXCTRL */
#define RF_TXCTRL_CH7			0x001E7DE0UL	/* 32-bit value to program to Sub-Register 0x28:0C – RF_TXCTRL */

