r-oung/stm32f4-firmware/prj/uwb-positioning/src/deca_regs.h
/* offset from TX_CAL_ID in bytes */
#define RF_STATUS_OFFSET		0x2C	/*  */

//#define RF_RXCTRLH_			0x00000000UL	/*  */


/****************************************************************************//**
 * @brief Bit definitions for register
**/
#define REG_29_ID_RESERVED		0x29

/****************************************************************************//**
 * @brief Bit definitions for register TX_CAL
 * Refer to section 7.2.43 Register file: 0x2A – Transmitter Calibration block
**/
#define TX_CAL_ID               0x2A            /* Transmitter calibration block */
#define TX_CAL_LEN				(52)
/* offset from TX_CAL_ID in bytes */
#define TC_SARC_OFFSET		    0x00         	/* SAR control */
#define TC_SARC_LEN 			(2)
#define TC_SARC_SAR_CTRL		0x01
 /* offset from TX_CAL_ID in bytes */
#define TC_SARL_OFFSET			0x03			/* Transmitter Calibration – Latest SAR readings. RO */
#define TC_SARL_LEN 			(3)
/*cause bug in register block TX_CAL, we need to read 1 byte in a time*/
#define TC_SARL_SAR_LTEMP_OFFSET	(4)			/* Latest SAR reading for Temperature level */
#define TC_SARL_SAR_LVBAT_OFFSET	(3)			/* Latest SAR reading for Voltage level */
												/* offset from TX_CAL_ID in bytes */
//#define TC_SARW_OFFSET			0x06		/* Transmitter Calibration – SAR readings at last Wake-Up */
//#define TC_SARW_LEN 			(2)
#define TC_SARW_SAR_WTEMP_OFFSET	0x06		/* SAR reading of Temperature level taken at last wakeup event */
#define TC_SARW_SAR_WVBAT_OFFSET	0x07		/* SAR reading of Voltage level taken at last wakeup event */
												/* offset from TX_CAL_ID in bytes */
#define TC_PGDELAY_OFFSET		0x0B			/* Transmitter Calibration – Pulse Generator Delay */
#define TC_PGDELAY_LEN			(1)
#define TC_PGDELAY_CH1			0xC9			/* Recommended value for channel 1 */
#define TC_PGDELAY_CH2			0xC2			/* Recommended value for channel 2 */
#define TC_PGDELAY_CH3			0xC5			/* Recommended value for channel 3 */
#define TC_PGDELAY_CH4			0x95			/* Recommended value for channel 4 */
#define TC_PGDELAY_CH5			0xC0			/* Recommended value for channel 5 */
#define TC_PGDELAY_CH7			0x93			/* Recommended value for channel 7 */
												/* offset from TX_CAL_ID in bytes */
#define TC_PGTEST_OFFSET		0x0C			/* Transmitter Calibration – Pulse Generator Test */
#define TC_PGTEST_LEN			(1)
#define TC_PGTEST_NORMAL		0x00			/* Normal operation */
#define TC_PGTEST_CW			0x13			/* Continuous Wave (CW) Test Mode */

/****************************************************************************//**
 * @brief Bit definitions for register
 * Refer to section 7.2.44 Register file: 0x2B – Frequency synthesiser control block
**/
#define FS_CTRL_ID            	0x2B            /* Frequency synthesiser control block */
#define FS_CTRL_LEN             (21)
/* offset from FS_CTRL_ID in bytes */
#define	FS_RES1_OFFSET			0x00			/* reserved area. Please take care not to write to this area as doing so may cause the DW1000 to malfunction. */
#define	FS_RES1_LEN				(7)
/* offset from FS_CTRL_ID in bytes */
#define FS_PLLCFG_OFFSET		0x07			/* Frequency synthesiser – PLL configuration */
#define FS_PLLCFG_LEN           (4)
#define FS_PLLCFG_CH1			0x09000407UL	/* Operating Channel 1 */
#define FS_PLLCFG_CH2           0x08400508UL    /* Operating Channel 2 (same as 4) */
#define FS_PLLCFG_CH3			0x08401009UL	/* Operating Channel 3 */
#define FS_PLLCFG_CH4           0x08400508UL    /* Operating Channel 4 (same as 2) */
#define FS_PLLCFG_CH5           0x0800041DUL    /* Operating Channel 5 (same as 7) */
#define FS_PLLCFG_CH7           0x0800041DUL    /* Operating Channel 7 (same as 5) */
/* offset from FS_CTRL_ID in bytes */
#define FS_PLLTUNE_OFFSET		0x0B			/* Frequency synthesiser – PLL Tuning */
#define FS_PLLTUNE_LEN			(1)
#define FS_PLLTUNE_CH1			0x1E	/* Operating Channel 1 */
#define FS_PLLTUNE_CH2          0x26    /* Operating Channel 2 (same as 4) */
#define FS_PLLTUNE_CH3			0x5E	/* Operating Channel 3 */
#define FS_PLLTUNE_CH4          0x26    /* Operating Channel 4 (same as 2) */
#define FS_PLLTUNE_CH5          0xA6    /* Operating Channel 5 (same as 7) */
#define FS_PLLTUNE_CH7          0xA6    /* Operating Channel 7 (same as 5) */
/* offset from FS_CTRL_ID in bytes */
#define	FS_RES2_OFFSET			0x0C	/* reserved area. Please take care not to write to this area as doing so may cause the DW1000 to malfunction. */
#define	FS_RES2_LEN				(2)
/* offset from FS_CTRL_ID in bytes */
#define FS_XTALT_OFFSET			0x0E	/* Frequency synthesiser – Crystal trim */
#define FS_XTALT_LEN			(1)
#define FS_XTALT_MASK			0x1F	/* Crystal Trim. Crystals may be trimmed using this register setting to tune out errors, see 8.1 – IC Calibration – Crystal Oscillator Trim. */
/* offset from FS_CTRL_ID in bytes */
#define FS_RES3_OFFSET			0x0F	/* reserved area. Please take care not to write to this area as doing so may cause the DW1000 to malfunction. */
#define FS_RES3_LEN				(6)

/****************************************************************************//**
 * @brief Bit definitions for register
**/
#define AON_ID                  0x2C            /* Always-On register set */
#define AON_LEN					(12)
/* offset from AON_ID in bytes */
#define AON_WCFG_OFFSET			0x00	/* used to control what the DW1000 IC does as it wakes up from low-power SLEEP or DEEPSLEEPstates. */
#define AON_WCFG_LEN			(2)
#define AON_WCFG_MASK			0x09CB	/* access mask to AON_WCFG register*/
#define AON_WCFG_ONW_RADC		0x0001	/* On Wake-up Run the (temperature and voltage) Analog-to-Digital Convertors */
#define AON_WCFG_ONW_RX 		0x0002	/* On Wake-up turn on the Receiver */
#define AON_WCFG_ONW_LEUI		0x0008	/* On Wake-up load the EUI from OTP memory into Register file: 0x01 – Extended Unique Identifier. */
#define AON_WCFG_ONW_LDC		0x0040	/* On Wake-up load configurations from the AON memory into the host interface register set */
#define AON_WCFG_ONW_L64P		0x0080	/* On Wake-up load the Length64 receiver operating parameter set */
#define AON_WCFG_PRES_SLEEP		0x0100	/* Preserve Sleep. This bit determines what the DW1000 does with respect to the ARXSLP and ATXSLP sleep controls */
#define AON_WCFG_ONW_LLDE		0x0800	/* On Wake-up load the LDE microcode. */
/* offset from AON_ID in bytes */
#define AON_CTRL_OFFSET			0x02	/* The bits in this register in general cause direct activity within the AON block with respect to the stored AON memory */
#define AON_CTRL_LEN			(1)
#define AON_CTRL_MASK			0x8F	/* access mask to AON_CTRL register */
#define AON_CTRL_RESTORE		0x01	/* When this bit is set the DW1000 will copy the user configurations from the AON memory to the host interface register set. */
#define AON_CTRL_SAVE			0x02	/* When this bit is set the DW1000 will copy the user configurations from the host interface register set into the AON memory */
#define AON_CTRL_UPL_CFG		0x04	/* Upload the AON block configurations to the AON  */
#define AON_CTRL_DCA_READ		0x08	/* Direct AON memory access read */
#define AON_CTRL_DCA_ENAB		0x80	/* Direct AON memory access enable bit */
/* offset from AON_ID in bytes */
#define AON_RDAT_OFFSET			0x03	/* AON Direct Access Read Data Result */
#define AON_RDAT_LEN			(1)
/* offset from AON_ID in bytes */
#define AON_ADDR_OFFSET			0x04	/* AON Direct Access Address */
#define AON_ADDR_LEN			(1)

/* offset from AON_ID in bytes */
#define AON_CFG0_OFFSET			0x06	/* 32-bit configuration register for the always on block. */
#define AON_CFG0_LEN			(4)
#define AON_CFG0_SLEEP_EN			0x00000001UL	/* This is the sleep enable configuration bit */
#define AON_CFG0_WAKE_PIN			0x00000002UL	/* Wake using WAKEUP pin */
#define AON_CFG0_WAKE_SPI			0x00000004UL	/* Wake using SPI access SPICSn */
#define AON_CFG0_WAKE_CNT			0x00000008UL	/* Wake when sleep counter elapses */
#define AON_CFG0_LPDIV_EN			0x00000010UL	/* Low power divider enable configuration */
#define AON_CFG0_LPCLKDIVA_MASK		0x0000FFE0UL	/* divider count for dividing the raw DW1000 XTAL oscillator frequency to set an LP clock frequency */
#define AON_CFG0_LPCLKDIVA_SHIFT	(5)
#define AON_CFG0_SLEEP_TIM			0xFFFF0000UL	/* Sleep time. This field configures the sleep time count elapse value */
#define AON_CFG0_SLEEP_SHIFT		(16)
/* offset from AON_ID in bytes */
#define AON_CFG1_OFFSET			0x0A
#define AON_CFG1_LEN			(2)
#define AON_CFG1_MASK			0x0007	/* aceess mask to AON_CFG1 */
#define AON_CFG1_SLEEP_CEN		0x0001	/* This bit enables the sleep counter */
#define AON_CFG1_SMXX			0x0002	/* This bit needs to be set to 0 for correct operation in the SLEEP state within the DW1000 */
#define AON_CFG1_LPOSC_CAL		0x0004	/* This bit enables the calibration function that measures the period of the IC’s internal low powered oscillator */

/****************************************************************************//**
 * @brief Bit definitions for register OTP_IF
 * Refer to section 7.2.46 Register file: 0x2D – OTP Memory Interface
**/
#define OTP_IF_ID               0x2D            /* One Time Programmable Memory Interface */
#define OTP_IF_LEN				(18)
/* offset from OTP_IF_ID in bytes */
#define OTP_WDAT				0x00			/* 32-bit register. The data value to be programmed into an OTP location  */
#define OTP_WDAT_LEN			(4)
/* offset from OTP_IF_ID in bytes */
#define OTP_ADDR				0x04			/* 16-bit register used to select the address within the OTP memory block */
#define OTP_ADDR_LEN			(2)
#define OTP_ADDR_MASK			0x07FF			/* This 11-bit field specifies the address within OTP memory that will be accessed read or written. */
/* offset from OTP_IF_ID in bytes */
#define OTP_CTRL                0x06            /* used to control the operation of the OTP memory */
#define OTP_CTRL_LEN            (2)
#define OTP_CTRL_MASK           0x8002
#define OTP_CTRL_OTPRDEN		0x0001			/* This bit forces the OTP into manual read mode */
#define OTP_CTRL_OTPREAD        0x0002          /* This bit commands a read operation from the address specified in the OTP_ADDR register */
#define OTP_CTRL_LDELOAD        0x8000          /* This bit forces a load of LDE microcode */
#define OTP_CTRL_OTPPROG        0x0040          /* Setting this bit will cause the contents of OTP_WDAT to be written to OTP_ADDR. */
/* offset from OTP_IF_ID in bytes */
#define OTP_STAT				0x08
#define OTP_STAT_LEN			(2)
#define OTP_STAT_MASK			0x0003
#define OTP_STAT_OTPPRGD		0x0001			/* OTP Programming Done */
//#define OTP_STAT_OTPVLTOK		0x0002			/* OTP Programming Voltage OK */   !!!!!!!!!!!!
/* offset from OTP_IF_ID in bytes */
#define	OTP_RDAT				0x0A			/* 32-bit register. The data value read from an OTP location will appear here */
#define	OTP_RDAT_LEN			(4)
/* offset from OTP_IF_ID in bytes */
#define	OTP_SRDAT				0x0E			/* 32-bit register. The data value stored in the OTP SR (0x400) location will appear here after power up */
#define	OTP_SRDAT_LEN			(4)
/* offset from OTP_IF_ID in bytes */
#define	OTP_SF					0x12			/*8-bit special function register used to select and load special receiver operational parameter */
#define	OTP_SF_LEN				(1)
#define	OTP_SF_MASK				0x61
#define	OTP_SF_OPS_KICK			0x01			/* This bit when set initiates a load of the operating parameter set selected by the OPS_SEL */
#define	OTP_SF_OPS_SEL_L64		0x00			/* Operating parameter set selection: Length64 */
#define	OTP_SF_OPS_SEL_TIGHT	0x40			/* Operating parameter set selection: Tight */

/****************************************************************************//**
 * @brief Bit definitions for register LDE_IF
 * Refer to section 7.2.47 Register file: 0x2E – Leading Edge Detection Interface
 * PLEASE NOTE: Other areas within the address space of Register file: 0x2E – Leading Edge Detection Interface
 * are reserved. To ensure proper operation of the LDE algorithm (i.e. to avoid loss of performance or a malfunction),
 * care must be taken not to write to any byte locations other than those defined in the sub-sections below.
**/
#define LDE_IF_ID             	0x2E            /* Leading edge detection control block */
#define LDE_IF_LEN				(0)
/* offset from LDE_IF_ID in bytes */
#define LDE_THRESH_OFFSET		0x0000	/* 16-bit status register reporting the threshold that was used to find the first path */
#define LDE_THRESH_LEN			(2)
/* offset from LDE_IF_ID in bytes */
#define LDE_CFG1_OFFSET			0x0806	/*8-bit configuration register*/
#define LDE_CFG1_LEN			(1)
#define LDE_CFG1_NSTDEV_MASK	0x1F	/* Number of Standard Deviations mask. */
#define LDE_CFG1_PMULT_MASK		0xE0	/* Peak Multiplier mask. */
/* offset from LDE_IF_ID in bytes */
#define LDE_PPINDX_OFFSET		0x1000	/* reporting the position within the accumulator that the LDE algorithm has determined to contain the maximum */
#define LDE_PPINDX_LEN			(2)
/* offset from LDE_IF_ID in bytes */
#define LDE_PPAMPL_OFFSET		0x1002	/* reporting the magnitude of the peak signal seen in the accumulator data memory */
#define LDE_PPAMPL_LEN			(2)
/* offset from LDE_IF_ID in bytes */
#define LDE_RXANTD_OFFSET		0x1804	/* 16-bit configuration register for setting the receive antenna delay */
#define LDE_RXANTD_LEN			(2)
/* offset from LDE_IF_ID in bytes */
#define LDE_CFG2_OFFSET			0x1806	/* 16-bit LDE configuration tuning register */
#define LDE_CFG2_LEN			(2)

#define LDE_CFG2_PRF16 			0x1607
#define LDE_CFG2_PRF64 			0x0607
/* offset from LDE_IF_ID in bytes */
#define LDE_REPC_OFFSET			0x2804	/* 16-bit configuration register for setting the replica avoidance coefficient */
#define LDE_REPC_LEN			(2)

/****************************************************************************//**
 * @brief Bit definitions for register DIG_DIAG
 * Digital Diagnostics interface.
 * It contains a number of sub-registers that give diagnostics information.
**/
#define DIG_DIAG_ID    	        0x2F    	/* Digital Diagnostics Interface */
#define DIG_DIAG_LEN            (41)

/* offset from DIG_DIAG_ID in bytes */
#define EVC_CTRL_OFFSET			0x00		/* Event Counter Control */
#define EVC_CTRL_LEN			(4)
#define EVC_CTRL_MASK			0x00000003UL/* access mask to Register for bits should always be set to zero to avoid any malfunction of the device. */
#define EVC_EN					0x00000001UL/* Event Counters Enable bit */
#define EVC_CLR					0x00000002UL

/* offset from DIG_DIAG_ID in bytes */
#define EVC_PHE_OFFSET			0x04		/* PHR Error Event Counter */
#define EVC_PHE_LEN				(2)
#define EVC_PHE_MASK			0x0FFF
/* offset from DIG_DIAG_ID in bytes */
#define EVC_RSE_OFFSET			0x06		/* Reed Solomon decoder (Frame Sync Loss) Error Event Counter */
#define EVC_RSE_LEN				(2)
#define EVC_RSE_MASK			0x0FFF

/* offset from DIG_DIAG_ID in bytes */
#define EVC_FCG_OFFSET			0x08		/* The EVC_FCG field is a 12-bit counter of the frames received with good CRC/FCS sequence. */
#define EVC_FCG_LEN				(2)
#define EVC_FCG_MASK			0x0FFF
/* offset from DIG_DIAG_ID in bytes */
#define EVC_FCE_OFFSET			0x0A		/* The EVC_FCE field is a 12-bit counter of the frames received with bad CRC/FCS sequence. */
#define EVC_FCE_LEN				(2)
#define EVC_FCE_MASK			0x0FFF

/* offset from DIG_DIAG_ID in bytes */
#define EVC_FFR_OFFSET			0x0C		/* The EVC_FFR field is a 12-bit counter of the frames rejected by the receive frame filtering function. */
#define EVC_FFR_LEN				(2)
#define EVC_FFR_MASK			0x0FFF
/* offset from DIG_DIAG_ID in bytes */
#define EVC_OVR_OFFSET			0x0E		/* The EVC_OVR field is a 12-bit counter of receive overrun events */
#define EVC_OVR_LEN				(2)
#define EVC_OVR_MASK			0x0FFF

/* offset from DIG_DIAG_ID in bytes */
#define EVC_STO_OFFSET			0x10		/* The EVC_STO field is a 12-bit counter of SFD Timeout Error events */
#define EVC_OVR_LEN				(2)
#define EVC_OVR_MASK			0x0FFF
/* offset from DIG_DIAG_ID in bytes */
#define EVC_PTO_OFFSET			0x12		/* The EVC_PTO field is a 12-bit counter of Preamble detection Timeout events */
#define EVC_PTO_LEN				(2)
#define EVC_PTO_MASK			0x0FFF

/* offset from DIG_DIAG_ID in bytes */
#define EVC_FWTO_OFFSET			0x14		/* The EVC_FWTO field is a 12-bit counter of receive frame wait timeout events */
#define EVC_FWTO_LEN			(2)
#define EVC_FWTO_MASK			0x0FFF
/* offset from DIG_DIAG_ID in bytes */
#define EVC_TXFS_OFFSET			0x16		/* The EVC_TXFS field is a 12-bit counter of transmit frames sent. This is incremented every time a frame is sent */
#define EVC_TXFS_LEN			(2)
#define EVC_TXFS_MASK			0x0FFF

/* offset from DIG_DIAG_ID in bytes */
#define EVC_HPW_OFFSET			0x18		/* The EVC_HPW field is a 12-bit counter of “Half Period Warnings”. */
#define EVC_HPW_LEN				(2)
#define EVC_HPW_MASK			0x0FFF
/* offset from DIG_DIAG_ID in bytes */
#define EVC_TPW_OFFSET			0x1A		/* The EVC_TPW field is a 12-bit counter of “Transmitter Power-Up Warnings”. */
#define EVC_TPW_LEN				(2)
#define EVC_TPW_MASK			0x0FFF

/* offset from DIG_DIAG_ID in bytes */
#define EVC_RES1_OFFSET			0x1C		/* Please take care not to write to this register as doing so may cause the DW1000 to malfunction. */

/* offset from DIG_DIAG_ID in bytes */
#define DIAG_TMC_OFFSET			0x24
#define DIAG_TMC_LEN			(2)
#define DIAG_TMC_MASK			0x0010
#define DIAG_TMC_TX_PSTM		0x0010		/* This test mode is provided to help support regulatory approvals spectral testing. When the TX_PSTM bit is set it enables a repeating transmission of the data from the TX_BUFFER */


/****************************************************************************//**
 * @brief Bit definitions for register 0x30-0x35
 * Please take care not to write to these registers as doing so may cause the DW1000 to malfunction.
**/
#define REG_30_ID_RESERVED		0x30
#define REG_31_ID_RESERVED		0x31
#define REG_32_ID_RESERVED		0x32
#define REG_33_ID_RESERVED		0x33
#define REG_34_ID_RESERVED		0x34
#define REG_35_ID_RESERVED		0x35

/****************************************************************************//**
 * @brief Bit definitions for register PMSC
**/
#define PMSC_ID                 0x36            /* Power Management System Control Block */
#define PMSC_LEN				(48)
/* offset from PMSC_ID in bytes */
#define	PMSC_CTRL0_OFFSET		0x00
#define	PMSC_CTRL0_LEN			(4)
#define	PMSC_CTRL0_DEFAULT		0xF0300200UL	/* reset value of register PMSC_CTRL0 */
#define	PMSC_CTRL0_MASK			0xF08F847FUL	/* access mask to register PMSC_CTRL0 */
#define	PMSC_CTRL0_SYSCLKS_AUTO	0x00000000UL	/* The system clock will run off the 19.2 MHz XTI clock until the PLL is calibrated and locked, then it will switch over the 125 MHz PLL clock */
#define	PMSC_CTRL0_SYSCLKS_19M	0x00000001UL	/* Force system clock to be the 19.2 MHz XTI clock. */
#define	PMSC_CTRL0_SYSCLKS_125M	0x00000002UL	/* Force system clock to the 125 MHz PLL clock. */
#define	PMSC_CTRL0_RXCLKS_AUTO	0x00000000UL	/* The RX clock will be disabled until it is required for an RX operation */
#define	PMSC_CTRL0_RXCLKS_19M	0x00000004UL	/* Force RX clock enable and sourced clock from the 19.2 MHz XTI clock */
#define	PMSC_CTRL0_RXCLKS_125M	0x00000008UL	/* Force RX clock enable and sourced from the 125 MHz PLL clock */
#define	PMSC_CTRL0_RXCLKS_OFF	0x0000000CUL	/* Force RX clock off. */
#define	PMSC_CTRL0_TXCLKS_AUTO	0x00000000UL	/* The TX clock will be disabled until it is required for a TX operation */
#define	PMSC_CTRL0_TXCLKS_19M	0x00000010UL	/* Force TX clock enable and sourced clock from the 19.2 MHz XTI clock */
#define	PMSC_CTRL0_TXCLKS_125M	0x00000020UL	/* Force TX clock enable and sourced from the 125 MHz PLL clock */
#define	PMSC_CTRL0_TXCLKS_OFF	0x00000030UL	/* Force TX clock off */
#define	PMSC_CTRL0_FACE			0x00000040UL	/* Force Accumulator Clock Enable */
#define PMSC_CTRL0_ADCCE		0x00000400UL    /* ADC Clock Enable */
#define PMSC_CTRL0_AMCE 		0x00008000UL 	/* Accumulator memory clock Enable */
#define PMSC_CTRL0_GPCE 		0x00010000UL 	/* GPIO Clock Enable */
#define PMSC_CTRL0_GPRN 		0x00020000UL 	/* GPIO Reset */
#define PMSC_CTRL0_GPDCE 		0x00040000UL 	/* GPIO De-bounce Clock Enable */
#define PMSC_CTRL0_GPDRN 		0x00080000UL 	/* GPIO De-bounce Reset */
#define PMSC_CTRL0_KHZCLKEN		0x00800000UL 	/* Kiloherz Clock Enable*/
/* offset from PMSC_ID in bytes */
#define	PMSC_CTRL1_OFFSET		0x04
#define	PMSC_CTRL1_LEN			(4)
#define PMSC_CTRL1_MASK			0xFC02F802UL	/* access mask to register PMSC_CTRL1 */
#define PMSC_CTRL1_ARX2INIT		0x00000002UL	/* Automatic transition from receive mode into the INIT state */
#define PMSC_CTRL1_ATXSLP		0x00000800UL	/* If this bit is set then the DW1000 will automatically transition into SLEEP or DEEPSLEEP mode after transmission of a frame */
#define PMSC_CTRL1_ARXSLP		0x00001000UL	/* this bit is set then the DW1000 will automatically transition into SLEEP mode after a receive attempt */
#define PMSC_CTRL1_SNOZE		0x00002000UL	/* Snooze Enable */
#define PMSC_CTRL1_SNOZR		0x00004000UL	/* The SNOZR bit is set to allow the snooze timer to repeat twice */
#define PMSC_CTRL1_PLLSYN		0x00008000UL	/* This enables a special 1 GHz clock used for some external SYNC modes */
#define PMSC_CTRL1_LDERUNE		0x00020000UL	/* This bit enables the running of the LDE algorithm */
#define PMSC_CTRL1_KHZCLKDIV_MASK	0xFC000000UL	/* Kilohertz clock divisor */
#define PMSC_CTRL1_PKTSEQ_DISABLE   0x00		/* writing this to PMSC CONTROL 1 register (bits 10-3) disables PMSC control of analog RF subsystems */
#define PMSC_CTRL1_PKTSEQ_ENABLE    0xE7		/* writing this to PMSC CONTROL 1 register (bits 10-3) enables PMSC control of analog RF subsystems */
/* offset from PMSC_ID in bytes */
#define	PMSC_RES1_OFFSET		0x08
/* offset from PMSC_ID in bytes */
#define	PMSC_SNOZT_OFFSET		0x0C			/* PMSC Snooze Time Register */
#define	PMSC_SNOZT_LEN			(1)
/* offset from PMSC_ID in bytes */
#define	PMSC_RES2_OFFSET		0x10
/* offset from PMSC_ID in bytes */
#define	PMSC_RES3_OFFSET		0x24
/* offset from PMSC_ID in bytes */
#define PMSC_TXFINESEQ_OFFSET       0x26		/* Writing PMSC_TXFINESEQ_DIS_MASK disables fine grain sequencing in the transmitter*/
#define PMSC_TXFINESEQ_DIS_MASK     (0x0)	
#define PMSC_TXFINESEQ_EN_MASK      (0B74)      /* Writing PMSC_TXFINESEQ_EN_MASK enables fine grain sequencing in the transmitter*/
/* offset from PMSC_ID in bytes */
#define	PMSC_LEDC_OFFSET			0x28
#define	PMSC_LEDC_LEN				(4)
#define PMSC_LEDC_MASK				0x000001FFUL	/* 32-bit LED control register. */
#define PMSC_LEDC_BLINK_TIM_MASK	0x000000FFUL	/* This field determines how long the LEDs remain lit after an event that causes them to be set on. default 0x20 give 0x20 * 14mS = 400mS */
#define PMSC_LEDC_BLNKEN			0x00000100UL	/* Blink Enable. When this bit is set to 1 the LED blink feature is enabled. */

/****************************************************************************//**
 * @brief Bit definitions for register 0x37-0x3F
 * Please take care not to write to these registers as doing so may cause the DW1000 to malfunction.
**/
#define REG_37_ID_RESERVED		0x37
#define REG_38_ID_RESERVED		0x38
#define REG_39_ID_RESERVED		0x39
#define REG_3A_ID_RESERVED		0x3A
#define REG_3B_ID_RESERVED		0x3B
#define REG_3C_ID_RESERVED		0x3C
#define REG_3D_ID_RESERVED		0x3D
#define REG_3E_ID_RESERVED		0x3E
#define REG_3F_ID_RESERVED		0x3F

/* END DW1000 REGISTER DEFINITION */

#ifdef __cplusplus
}
#endif

#endif